//com.js

/*

1：
    十几乘十几
    口诀：头乘头，尾加尾，尾乘尾。
    
    例如：
        12x12=？
    运用口诀：
        1,头乘头   1x1=1
        2,尾加尾   2+2=4
        3,尾乘尾   2x2=4
        
    相加口诀 1,2,3步计算出的结果：
        1
         4
       +  4
    ---------
        144
        
        
    结果：144
        
    
    
    例如：
        13x19=？
    运用口诀：
        1,头乘头   1x1=1
        2,尾加尾   3+9=12
        3,尾乘尾   3x9=27
        
    相加口诀 1,2,3步计算出的结果：
        1
        12
       + 27
    ---------
        247
        
    结果：247
    
    
    
    例如：
        15x18=？
    运用口诀：
        1,头乘头   1x1=1
        2,尾加尾   5+8=13
        3,尾乘尾   5x8=40
        
    相加口诀 1,2,3步计算出的结果：
        1
        13
       + 40
    ---------
        270
        
    结果：270
    
    
    
    
    

        
    //com.js


2：
    头相同,尾互补 (尾互补的意思是：尾相加等于10)
    口诀：一个头加1后，头乘头，尾乘尾。
    注意：尾乘尾如果为各位，则十位补0
    
    例如：
        23x27=？
    运用口诀：
        1,一个头加1后    2+1=3 //第一个数23的头是2，2+1=3 ，计算结果参与下一步计算，不参与最后结果的计算
        2,头乘头         3x2=6 //上一部加1计算出的头，乘第二个数的头，
        3,尾乘尾         3x7=21
        
    相加口诀 2,3 步计算出的结果：
        6
       + 21
    ---------
        621
        
        
    结果：621
        
    
    
    例如：
        41x49=？
    运用口诀：
        1,一个头加1后    4+1=5 
        2,头乘头         5x4=20 
        3,尾乘尾         1x9=09 //尾乘尾如果为各位，则十位补0
        
    相加口诀 2,3 步计算出的结果：
        20
       +  09
    ---------
        2009
        
        
    结果：2009
        
    
    

    
    例如：
        74x76=？
    运用口诀：
        1,一个头加1后    7+1=8 
        2,头乘头         8x7=56 
        3,尾乘尾         4x6=24 
        
    相加口诀 2,3 步计算出的结果：
        56
       +  24
    ---------
        5624
        
        
    结果：5624
        
        
    
    
    

        
    //com.js


3：
    第一个乘数互补, 另一个乘数数字相同 
    口诀：一个头加1后，头乘头，尾乘尾。
    注意：尾乘尾如果为各位，则十位补0
    
    例如：
        28x22=？
    运用口诀：
        1,一个头加1后    2+1=3 //第一个数23的头是2，2+1=3 ，计算结果参与下一步计算，不参与最后结果的计算
        2,头乘头         3x2=6 //上一部加1计算出的头，乘第二个数的头，
        3,尾乘尾         8x2=16
        
    相加口诀 2,3 步计算出的结果：
        6
       + 16
    ---------
        616
        
        
    结果：616
        
    
    
    例如：
        37x44=？
    运用口诀：
        1,一个头加1后    3+1=4 
        2,头乘头         4x4=16 
        3,尾乘尾         7x4=28 
        
    相加口诀 2,3 步计算出的结果：
        16
       +  28
    ---------
        1628
        
        
    结果：1628
        
    
    

    
    例如：
        64x88=？
    运用口诀：
        1,一个头加1后    6+1=7 
        2,头乘头         7x8=56 
        3,尾乘尾         4x8=32 
        
    相加口诀 2,3 步计算出的结果：
        56
       +  32
    ---------
        5632
        
        
    结果：5632
        
    
    
    
    
    

        
    //com.js


4：
    几十一乘几十一
    口诀：头乘头，头加头，尾乘尾。
    注意：尾乘尾如果为各位，则十位补0
    
    例如：
        31x51=？
    运用口诀：
        1,头乘头   3x5=15 
        2,头加头   3+5=8 
        3,尾乘尾   1x1=1
        
    相加口诀 2,3 步计算出的结果：
        15
          8        
       +   1       
    ---------
        1581
        
        
    结果：1581
        
    
    
    例如：
        71x41=？
        
    运用口诀：
        1,头乘头   7x4=28 
        2,头加头   7+4=11 
        3,尾乘尾   1x1=1
        
    相加口诀 2,3 步计算出的结果：
        28
         11        
       +   1       
    ---------
        2911
        
        
    结果：2911
        
        
    
    
    例如：
        51x91=？
        
    运用口诀：
        1,头乘头   5x9=45 
        2,头加头   5+9=14 
        3,尾乘尾   1x1=1
        
    相加口诀 2,3 步计算出的结果：
        45
         14        
       +   1       
    ---------
        4641
        
        
    结果：4641
        
        
   
   
   
   */